In [2]:
### Подготовительная часть
# импортирование библиотек
import pandas as pd
import numpy as np
# загрузка данных 
pd.read_csv(filepath_or_buffer = "../../source/sp500_1.csv", 
            sep =',')
# модификация данных 
sp500 = pd.read_csv(filepath_or_buffer = "../../source/sp500_1.csv", 
            sep =',',
            usecols = ['Symbol', 'Sector', 'Price','Founded'],
            index_col = 'Symbol')
np.random.seed(123)
numbers = pd.Series(data = np.random.normal(size=10),
                    index = np.arange(25,35))
Simpsons = pd.Series({'Homer'  : 120,
                     'Marge'  : 60,
                     'BArt'   : 35,
                     'Lisa'   : 30,
                     'Maggie' : 7})

### Добавелние

In [3]:
# Создание копии, чтобы исходные данные не менять

In [4]:
sp500_copy=sp500.copy()

In [5]:
# Добавление столбца - добавление в конец

In [6]:
sp500_copy['RoundedPrice'] = sp500_copy.Price.round()
sp500_copy.head(3)

             Sector             Price Founded      RoundedPrice
Symbol
MMM     Industrials             66740    1902             66740
AOS     Industrials  4343243243432434    1916  4343243243432434
ABT     Health Care              1800    1888              1800

In [7]:
# метод insert - можно выбрать позицию куда вставить столбец

In [8]:
sp500_copy=sp500.copy()

In [9]:
# вставляем столебц RoundedPrice в качестве третьго столбца датафрейма

In [10]:
sp500_copy.insert(1, 'RoundedPrice', sp500_copy.Price.round())
sp500_copy.head(5)

,Sector,RoundedPrice,Price,Founded
Symbol,,,,
MMM,Industrials,66740,66740,1902
AOS,Industrials,4343243243432434,4343243243432434,1916
ABT,Health Care,1800,1800,1888
ABBV,Health Care,1551152,1551152,2013 (1888)
ACN,Information Technology,1467373,1467373,1989

In [11]:
# метод assign()
sp500_copy=sp500.copy()

In [12]:
# одноверменное добавение двух столбцов

In [15]:
sp500_copy.assign(Rounded_price=sp500_copy.Price.round(),
                  R_BookValue_Price=lambda x: (x['Price'] / x['Rounded_price']))

,Sector,Price,Founded,Rounded_price,R_BookValue_Price
Symbol,,,,,
MMM,Industrials,66740,1902,66740,1.0
AOS,Industrials,4343243243432434,1916,4343243243432434,1.0
ABT,Health Care,1800,1888,1800,1.0
ABBV,Health Care,1551152,2013 (1888),1551152,1.0
ACN,Information Technology,1467373,1989,1467373,1.0
...,...,...,...,...,...
YUM,Consumer Discretionary,1041061,1997,1041061,1.0
ZBRA,Information Technology,877212,1969,877212,1.0
ZBH,Health Care,1136869,1927,1136869,1.0
ZION,Financials,109380,1873,109380,1.0
ZTS,Health Care,1555280,1952,1555280,1.0

### Выравнивание данных
- автоматическое согласование связанных друг с другом значний нескольких объектов на основе меток индекса
- используется для избежаиня ошибко сопоставления данных их нескольких наборов данных

In [17]:
# Series
# Создание серий для работы 
s_1 = pd.Series(data=[77,33,11], index=['a','b','f'])
s_1

a    77
b    33
f    11
dtype: int64

In [18]:
s_2 = pd.Series(data=[11,5,6], index=['c','b','a'])
s_2

c    11
b     5
a     6
dtype: int64

In [19]:
# для непересекающейся части индексов будут получены значения NaN

In [20]:
s_1+s_2

a    83.0
b    38.0
c     NaN
f     NaN
dtype: float64

In [21]:
# Метки не обязатлеьно должны быть уникальными
s_1 = pd.Series(data=[77,33,15,3], index=['a','a','a','d'])
s_1

a    77
a    33
a    15
d     3
dtype: int64

In [22]:
s_2 =  pd.Series(data=[11,5,6], index=['c','a','a'])
s_2

c    11
a     5
a     6
dtype: int64

In [23]:
# 3-метки а и 2-метки а дают в результате 6 меток а (те произведение кол-ва меток)
s_2 + s_1

a    82.0
a    38.0
a    20.0
a    83.0
a    39.0
a    21.0
c     NaN
d     NaN
dtype: float64

In [24]:
# DataFrame

In [25]:
sp500_part_1 = sp500.iloc[0:5, 0:2].copy()
sp500_part_2 = sp500.iloc[2:7, 1:3].copy()

In [26]:
sp500_part_1

                        Sector             Price
Symbol
MMM                Industrials             66740
AOS                Industrials  4343243243432434
ABT                Health Care              1800
ABBV               Health Care           1551152
ACN     Information Technology           1467373

In [27]:
sp500_part_2

          Price      Founded
Symbol
ABT        1800         1888
ABBV    1551152  2013 (1888)
ACN     1467373         1989
ATVI     718877         2008
ADM        7084         1902

In [28]:
sp500_part_1 + sp500_part_2

        Founded      Price  Sector
Symbol
ABBV        NaN  3102304.0     NaN
ABT         NaN     3600.0     NaN
ACN         NaN  2934746.0     NaN
ADM         NaN        NaN     NaN
AOS         NaN        NaN     NaN
ATVI        NaN        NaN     NaN
MMM         NaN        NaN     NaN

In [29]:
# происходит выравнивание при создании датафрейма

In [30]:
series_1 = pd.Series([70,90])
series_2 = pd.Series([71,91])
series_3 = pd.Series([85,87], index=[1, 2])
df = pd.DataFrame({'col_1': series_1,
                   'col_2': series_2,
                   'col_3': series_3,})
df

   col_1  col_2  col_3
0   70.0   71.0    NaN
1   90.0   91.0   85.0
2    NaN    NaN   87.0

### Сортировка

In [31]:
# по индексу
sp500.head()

                        Sector             Price      Founded
Symbol
MMM                Industrials             66740         1902
AOS                Industrials  4343243243432434         1916
ABT                Health Care              1800         1888
ABBV               Health Care           1551152  2013 (1888)
ACN     Information Technology           1467373         1989

In [32]:
sp500.sort_index().head()

                        Sector    Price      Founded
Symbol
A                  Health Care  1090872         1999
AAL                Industrials     6201         1934
AAP     Consumer Discretionary  1158449         1932
AAPL    Information Technology   320193         1977
ABBV               Health Care  1551152  2013 (1888)

In [33]:
# axis=1 - сортировка по именам столбцов
sp500.sort_index(axis=1).head()

            Founded             Price                  Sector
Symbol
MMM            1902             66740             Industrials
AOS            1916  4343243243432434             Industrials
ABT            1888              1800             Health Care
ABBV    2013 (1888)           1551152             Health Care
ACN            1989           1467373  Information Technology

In [34]:
# по значению

In [35]:
sp500.sort_values(by='Price').head()

                        Sector  Price Founded
Symbol
ABT                Health Care   1800    1888
AMD     Information Technology   2488    1969
APD                  Materials   2969    1940
SWKS    Information Technology   4127    2002
HWM                Industrials   4281    2016

In [36]:
sp500.sort_values(by='Price', ascending=False).head()

             Sector             Price Founded
Symbol
AOS     Industrials  4343243243432434    1916
GEHC    Health Care           1932393    1994
CEG       Utilities           1868275    1999
APA          Energy           1841666    1954
OGN     Health Care           1821825    2021

In [37]:
# наибольшее и наименшие значения

In [38]:
sp500.nsmallest(5, 'Price')

                        Sector  Price Founded
Symbol
ABT                Health Care   1800    1888
AMD     Information Technology   2488    1969
APD                  Materials   2969    1940
SWKS    Information Technology   4127    2002
HWM                Industrials   4281    2016

In [39]:
sp500.nlargest(5, 'Price')

             Sector             Price Founded
Symbol
AOS     Industrials  4343243243432434    1916
GEHC    Health Care           1932393    1994
CEG       Utilities           1868275    1999
APA          Energy           1841666    1954
OGN     Health Care           1821825    2021